Revit 2026 API
OpenOptions.SetOpenWorksetsConfiguration Method
 Sets the object used to configure the worksets to open when the model is opened.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public void SetOpenWorksetsConfiguration(
	WorksetConfiguration openConfiguration
)
Public Sub SetOpenWorksetsConfiguration (
	openConfiguration As WorksetConfiguration
)
public:
void SetOpenWorksetsConfiguration(
	WorksetConfiguration^ openConfiguration
)
member SetOpenWorksetsConfiguration :
        openConfiguration : WorksetConfiguration -> unit
Parameters
openConfiguration WorksetConfiguration
 The options. If null, all user-created worksets will be opened.
Remarks
 These options are ignored for non-workshared models.
See Also
Reference
OpenOptions Class
Autodesk.Revit.DB Namespace